Revit 2027 API
PipeSettings.SetUp Property
 The abbreviation of the Set Up (SU) string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SetUp { get; set; }
Public Property SetUp As String
	Get
	Set
public:
property String^ SetUp {
	String^ get ();
	void set (String^ value);
}
member SetUp : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace